Диплом/src/Documents/ПоступлениеТовараИзПереработки/ПоступлениеТовараИзПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТовараИзПереработки</name>
  <basedOn>Document.ПереработкаСырья</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиМатериаловИТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ПереработкаЛесаВЩиты</registerRecords>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.РасходникиДляПроизводства_Номенклатура</types>
        <types>CatalogRef.ДеревянныеЩиты_Номенклатура</types>
        <types>CatalogRef.ЛесСырьё_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/AccumulationRegisters/ПереработкаЛесаВЩиты/ПереработкаЛесаВЩиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПереработкаЛесаВЩиты</name>
  <resources>
    <name>Количество_Леса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество_ПолученныхЩитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура_Леса</name>
    <type>
      <types>CatalogRef.РасходникиДляПроизводства_Номенклатура</types>
      <types>CatalogRef.ЛесСырьё_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура_Щитов</name>
    <type>
      <types>CatalogRef.ДеревянныеЩиты_Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Диплом/src/AccumulationRegisters/ОстаткиМатериаловИТоваров/ОстаткиМатериаловИТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериаловИТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.РасходникиДляПроизводства_Номенклатура</types>
      <types>CatalogRef.ДеревянныеЩиты_Номенклатура</types>
      <types>CatalogRef.ЛесСырьё_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Диплом/src/Documents/ПоступлениеТовараИзПереработки/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПереработкаСырья") Тогда
		// Заполнение шапки
		ОтветственноеЛицо = ДанныеЗаполнения.ОтветственноеЛицо;
		Получатель = ДанныеЗаполнения.Получатель;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура_Щитов;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ПереработкаЛесаВЩиты Расход
	Движения.ПереработкаЛесаВЩиты.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ПереработкаЛесаВЩиты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура_Щитов = ТекСтрокаТовары.Номенклатура;
		Движение.Количество_ПолученныхЩитов = ТекСтрокаТовары.Количество;
	КонецЦикла;
	// регистр ОстаткиМатериаловИТоваров Приход
	Движения.ОстаткиМатериаловИТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиМатериаловИТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Помещение = Получатель;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
КонецПроцедуры
